#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ArenaLeaderboard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArenaLeaderboard.ArenaLeaderboard_C
// 0x0038 (0x0408 - 0x03D0)
class UArenaLeaderboard_C final : public UFortPersistentLeaderboardScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackgroundBlur*                        BackgroundBlur_PosterLayer_1;                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardEntryDetails_C*        Details_EntryDisplay;                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PosterFade_2;                                // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_EventName;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ArenaLeaderboard(int32 EntryPoint);
	void Construct();
	void Item_Double_Clicked(class UObject* Item);
	void BP_OnDeactivated();
	void OnColorize(const struct FFortTournamentDisplayInfo& ColorInfo);
	void SetupForEvent(const class FString& EventId, const class FString& EventWindowId);
	void ShowMyStats(class UCommonButton* Button);
	void OnInitialized();
	void OnLeaderboardEntrySelected(const class UFortEventLeaderboardEntryData* EntryData);
	void Initialize_Children_For_Event(const class FString& Event_Id, const class FString& Event_Window_Id);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ArenaLeaderboard_C">();
	}
	static class UArenaLeaderboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArenaLeaderboard_C>();
	}
};

}

