#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_CCPM_Base_Niagara_Professor_Pup_Head

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_CCPM_Base_Niagara_Template_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_CCPM_Base_Niagara_Professor_Pup_Head.B_CCPM_Base_Niagara_Professor_Pup_Head_C
// 0x0038 (0x0418 - 0x03E0)
class AB_CCPM_Base_Niagara_Professor_Pup_Head_C final : public AB_CCPM_Base_Niagara_Template_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_CCPM_Base_Niagara_Professor_Pup_Head_C; // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Motorcycle_Light;                                  // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TimeOfDayChanges_LightAlpha_8878E8F449C4D221E9D18EAC2B73B922; // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TimeOfDayChanges__Direction_8878E8F449C4D221E9D18EAC2B73B922; // 0x03F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F5[0x3];                                      // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     TimeOfDayChanges;                                  // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  Fort_Pawn_Player;                                  // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoOnce;                                            // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UM_LRG_Professor_Pup_AnimBP_C*          AnimBP;                                            // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_CCPM_Base_Niagara_Professor_Pup_Head(int32 EntryPoint);
	void OnPawnAndPartChanged();
	void ResetTrue();
	void ResetFalse();
	void Character_Movement_Updated(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity);
	void OnBeginSkydiving();
	void OnEndSkydiving();
	void ResIn();
	void ResOut();
	void Enter_Vehicle();
	void Exit_Vehicle();
	void OnDayPhaseChanged(EFortDayPhase CurrentDayPhase, EFortDayPhase PreviousDayPhase, bool bAtCreation);
	void Night_Phase(bool At_Creation);
	void Evening_Phase(bool At_Creation);
	void Day_Phase(bool At_Creation);
	void Morning_Phase(bool At_Creation);
	void OnHitPawn(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnTargetingOrFirstPersonCameraChanged();
	void TimeOfDayChanges__UpdateFunc();
	void TimeOfDayChanges__FinishedFunc();
	void getIsDriving(bool* isDriving_0);
	void set_Niagara_System_User_Variable__Color_(class FName Name_0, const struct FLinearColor& Value);
	void set_Niagara_System_User_Variable__Float_(class FName Name_0, float Value);
	void set_Niagara_System_User_Variable__Int_(class FName Name_0, int32 Value);
	void set_Niagara_System_User_Variable__Vector_(class FName Name_0, const struct FVector& Value);
	void set_Niagara_System_User_Variable__Bool_(class FName Name_0, bool Value);
	void getNiagaraParticles(struct FGameplayTagContainer* Gameplay_Tag_Container);
	void getIsFrontEnd(bool* IsInFrontEnd_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_CCPM_Base_Niagara_Professor_Pup_Head_C">();
	}
	static class AB_CCPM_Base_Niagara_Professor_Pup_Head_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_CCPM_Base_Niagara_Professor_Pup_Head_C>();
	}
};

}

