#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BattlePAssTracker

#include "Basic.hpp"


namespace SDK::Params
{

// Function BattlePAssTracker.BattlePassTracker_C.HandleInitialState
// 0x0040 (0x0040 - 0x0000)
struct BattlePassTracker_C_HandleInitialState final
{
public:
	class UBattlePassItemTracker_C*               K2Node_DynamicCast_AsBattle_Pass_Item_Tracker;     // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UBattlePassItemTracker_C*               K2Node_DynamicCast_AsBattle_Pass_Item_Tracker_1;   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UBattlePassItemTracker_C*               K2Node_DynamicCast_AsBattle_Pass_Item_Tracker_2;   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UBattlePassItemTracker_C*               K2Node_DynamicCast_AsBattle_Pass_Item_Tracker_3;   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BattlePAssTracker.BattlePassTracker_C.HandleButtonIn
// 0x0008 (0x0008 - 0x0000)
struct BattlePassTracker_C_HandleButtonIn final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

