#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_TimeSynthTrackComponent_DataTracker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "BP_TimeSynthTrackComponent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TimeSynthTrackComponent_DataTracker.BP_TimeSynthTrackComponent_DataTracker_C
// 0x0070 (0x0210 - 0x01A0)
#pragma pack(push, 0x1)
class alignas(0x08) UBP_TimeSynthTrackComponent_DataTracker_C : public UBP_TimeSynthTrackComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_TimeSynthTrackComponent_DataTracker_C; // 0x01A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortGameplayDataTrackerComponent*      DataTrackerComponent;                              // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DataTrackerAssigned;                               // 0x01B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UClass*                                 DataTrackerComponentClass;                         // 0x01B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGameplayDataTrackerComponentManager* DataTrackerComponentManager;                     // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AwaitingCooldownBeforeShutoff;                     // 0x01C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USoundMix*                              SoundMix;                                          // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         EnabledDataRow;                                    // 0x01D8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FScalableFloat>                 TrackMixStateVolumeDataRows;                       // 0x01F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          MixPushed;                                         // 0x0208(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_TimeSynthTrackComponent_DataTracker(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnReady_FFC0E068479278E143D010AF8EB81D0D(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnDataTrackerStart();
	void OnDataTrackerUpdate();
	void OnDataTrackerEnd();
	void GetDataTrackerComponent(class UFortGameplayDataTrackerComponent** DataTrackerComponent_0);
	void AssignDataTrackerComponent(class UFortGameplayDataTrackerComponent* DataTrackerComponent_0);
	void GetDataTrackerComponentManager();
	void OnDataTrackerComponentRegistered(class UFortGameplayDataTrackerComponent* Data_Tracker_Component);
	void OnDataTrackerComponentUnRegistered(class UFortGameplayDataTrackerComponent* Data_Tracker_Component);
	void OnAnyEventValueChanged(class UFortGameplayDataTrackerComponent* Data_Tracker_Component, bool Has_Event_Values);
	void GetRemainingEventCooldown(float* Cooldown);
	void GetIsEnabled(bool* Enabled_0);
	void QueueTrackStop(bool Play_Outro);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TimeSynthTrackComponent_DataTracker_C">();
	}
	static class UBP_TimeSynthTrackComponent_DataTracker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TimeSynthTrackComponent_DataTracker_C>();
	}
};
#pragma pack(pop)

}

