#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CCPM_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CCPM_Base.CCPM_Base_C
// 0x0070 (0x03E0 - 0x0370)
class ACCPM_Base_C : public ACustomCharacterPartModifier
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           StaticMeshComponents;                              // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       CascadeComponents;                                 // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   Last_Pawn;                                         // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disable_Particles_during_Skydive;                  // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Disable_Particles_during_First_Person;             // 0x03A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Disable_Particles_in_Vehicle;                      // 0x03AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsDriving;                                        // 0x03AB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Event_Log_Color;                                   // 0x03AC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class FString>                         Hidding_prefixes;                                  // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UMeshComponent*                         Character_Part_Type;                               // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable_Debug_Printing;                             // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CCPM_Base(int32 EntryPoint);
	void Attachment();
	void OnPawnAndPartChanged();
	void isHiddingInProp(bool IsHidden);
	void PlayerMovementTick(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity);
	void ExitVehicle();
	void EnterVehicle();
	void Open();
	void ExitingHidingProp();
	void EnteringHidingProp();
	void OnTargetingOrFirstPersonCameraChanged();
	void Close();
	void OnEndSkydiving();
	void OnBeginSkydiving();
	void Reset_Enter_Vehicle();
	void Reset_Exit_Vehicle();
	void UserConstructionScript();
	void attachParticleSystem(class UParticleSystemComponent* Particle_System_Component, class FName Socket_Name);
	void overrideCharacterPartType(EFortCustomPartType Part_Type);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CCPM_Base_C">();
	}
	static class ACCPM_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACCPM_Base_C>();
	}
};

}

