#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: EventModeUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class EventModeUI.FocusButton
// 0x0010 (0x0598 - 0x0588)
class UFocusButton final : public UBacchusActionButton
{
public:
	class UPaperSprite*                           StartFocusingSprite;                               // 0x0588(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPaperSprite*                           StopFocusingSprite;                                // 0x0590(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleCanUseEventModeFocusChanged(bool bCanUseEventModeFocus);
	void HandleEventModeFocusingChanged(bool bIsEventModeFocusing);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FocusButton">();
	}
	static class UFocusButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFocusButton>();
	}
};

// Class EventModeUI.FortEventModeEmotesWidget
// 0x00B0 (0x0348 - 0x0298)
class UFortEventModeEmotesWidget final : public UFortHUDElementWidget
{
public:
	TSoftObjectPtr<class UFortMontageItemDefinitionBase> Emote1;                                     // 0x0298(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortMontageItemDefinitionBase> Emote2;                                     // 0x02C0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortMontageItemDefinitionBase> Emote3;                                     // 0x02E8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UFortMontageItemDefinitionBase>> RandomEmotes;                       // 0x0310(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_320[0x8];                                      // 0x0320(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class URichTextBlock*                         Text_Emote1;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                         Text_Emote2;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                         Text_Emote3;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                         Text_EmoteRandom;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnFocusAvailableChanged(bool bIsFocusAvailable);
	void OnFocusStateChanged(bool bIsFocusing);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventModeEmotesWidget">();
	}
	static class UFortEventModeEmotesWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventModeEmotesWidget>();
	}
};

// Class EventModeUI.FortMobileActionButtonBehavior_Focus
// 0x0008 (0x00B8 - 0x00B0)
class UFortMobileActionButtonBehavior_Focus : public UFortMobileActionButtonBehavior
{
public:
	class UPaperSprite*                           StopFocusingSprite;                                // 0x00B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleCanUseEventModeFocusChanged(bool bCanUseEventModeFocus);
	void HandleEventModeFocusingChanged(bool bIsEventModeFocusing);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileActionButtonBehavior_Focus">();
	}
	static class UFortMobileActionButtonBehavior_Focus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileActionButtonBehavior_Focus>();
	}
};

}

