#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: F_MED_Space_Wanderer_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function F_MED_Space_Wanderer_AnimBP.F_MED_Space_Wanderer_AnimBP_C.ExecuteUbergraph_F_MED_Space_Wanderer_AnimBP
// 0x0018 (0x0018 - 0x0000)
struct F_MED_Space_Wanderer_AnimBP_C_ExecuteUbergraph_F_MED_Space_Wanderer_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Context_1;                            // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Context;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function F_MED_Space_Wanderer_AnimBP.F_MED_Space_Wanderer_AnimBP_C.OnNotifyPartsStopped
// 0x0008 (0x0008 - 0x0000)
struct F_MED_Space_Wanderer_AnimBP_C_OnNotifyPartsStopped final
{
public:
	class FName                                   Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function F_MED_Space_Wanderer_AnimBP.F_MED_Space_Wanderer_AnimBP_C.OnNotifyPartsStarted
// 0x0008 (0x0008 - 0x0000)
struct F_MED_Space_Wanderer_AnimBP_C_OnNotifyPartsStarted final
{
public:
	class FName                                   Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function F_MED_Space_Wanderer_AnimBP.F_MED_Space_Wanderer_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct F_MED_Space_Wanderer_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

}

