#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortLayeredAudioComponent_Glider

#include "Basic.hpp"


namespace SDK::Params
{

// Function FortLayeredAudioComponent_Glider.FortLayeredAudioComponent_Glider_C.ExecuteUbergraph_FortLayeredAudioComponent_Glider
// 0x000C (0x000C - 0x0000)
struct FortLayeredAudioComponent_Glider_C_ExecuteUbergraph_FortLayeredAudioComponent_Glider final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ForwardDot;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_RightDot;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function FortLayeredAudioComponent_Glider.FortLayeredAudioComponent_Glider_C.Update Glider Audio
// 0x0008 (0x0008 - 0x0000)
struct FortLayeredAudioComponent_Glider_C_Update_Glider_Audio final
{
public:
	float                                         ForwardDot;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RightDot;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

