#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LiveLinkMovieScene

#include "Basic.hpp"

#include "LiveLinkInterface_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "LiveLinkMovieScene_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MovieSceneTracks_classes.hpp"


namespace SDK
{

// Class LiveLinkMovieScene.MovieSceneLiveLinkSection
// 0x0140 (0x0220 - 0x00E0)
class UMovieSceneLiveLinkSection final : public UMovieSceneSection
{
public:
	struct FLiveLinkSubjectPreset                 SubjectPreset;                                     // 0x00E0(0x0038)(NoDestructor, NativeAccessSpecifierPublic)
	TArray<bool>                                  ChannelMask;                                       // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMovieSceneLiveLinkSubSection*>  SubSections;                                       // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_138[0x10];                                     // 0x0138(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	class FName                                   SubjectName;                                       // 0x0148(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLiveLinkFrameData                     TemplateToPush;                                    // 0x0150(0x0090)(Deprecated, NativeAccessSpecifierPublic)
	struct FLiveLinkRefSkeleton                   RefSkeleton;                                       // 0x01E0(0x0020)(Deprecated, NativeAccessSpecifierPublic)
	TArray<class FName>                           CurveNames;                                        // 0x0200(0x0010)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMovieSceneFloatChannel>        PropertyFloatChannels;                             // 0x0210(0x0010)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneLiveLinkSection">();
	}
	static class UMovieSceneLiveLinkSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLiveLinkSection>();
	}
};

// Class LiveLinkMovieScene.MovieSceneLiveLinkSubSection
// 0x0028 (0x0050 - 0x0028)
class UMovieSceneLiveLinkSubSection : public UObject
{
public:
	struct FLiveLinkSubSectionData                SubSectionData;                                    // 0x0028(0x0010)(NativeAccessSpecifierPublic)
	TSubclassOf<class ULiveLinkRole>              SubjectRole;                                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneLiveLinkSubSection">();
	}
	static class UMovieSceneLiveLinkSubSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLiveLinkSubSection>();
	}
};

// Class LiveLinkMovieScene.MovieSceneLiveLinkSubSectionAnimation
// 0x0010 (0x0060 - 0x0050)
class UMovieSceneLiveLinkSubSectionAnimation final : public UMovieSceneLiveLinkSubSection
{
public:
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneLiveLinkSubSectionAnimation">();
	}
	static class UMovieSceneLiveLinkSubSectionAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLiveLinkSubSectionAnimation>();
	}
};

// Class LiveLinkMovieScene.MovieSceneLiveLinkSubSectionBasicRole
// 0x0010 (0x0060 - 0x0050)
class UMovieSceneLiveLinkSubSectionBasicRole final : public UMovieSceneLiveLinkSubSection
{
public:
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneLiveLinkSubSectionBasicRole">();
	}
	static class UMovieSceneLiveLinkSubSectionBasicRole* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLiveLinkSubSectionBasicRole>();
	}
};

// Class LiveLinkMovieScene.MovieSceneLiveLinkSubSectionProperties
// 0x0010 (0x0060 - 0x0050)
class UMovieSceneLiveLinkSubSectionProperties final : public UMovieSceneLiveLinkSubSection
{
public:
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneLiveLinkSubSectionProperties">();
	}
	static class UMovieSceneLiveLinkSubSectionProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLiveLinkSubSectionProperties>();
	}
};

// Class LiveLinkMovieScene.MovieSceneLiveLinkTrack
// 0x0008 (0x0090 - 0x0088)
class UMovieSceneLiveLinkTrack final : public UMovieScenePropertyTrack
{
public:
	TSubclassOf<class ULiveLinkRole>              TrackRole;                                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneLiveLinkTrack">();
	}
	static class UMovieSceneLiveLinkTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLiveLinkTrack>();
	}
};

}

