#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LiveStreamAnimation

#include "Basic.hpp"

#include "LiveStreamAnimation_structs.hpp"


namespace SDK::Params
{

// Function LiveStreamAnimation.LiveStreamAnimationSubsystem.SetAcceptClientPackets_Private
// 0x0001 (0x0001 - 0x0000)
struct LiveStreamAnimationSubsystem_SetAcceptClientPackets_Private final
{
public:
	bool                                          bInShouldAcceptClientPackets;                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LiveStreamAnimation.LiveStreamAnimationSubsystem.SetRole
// 0x0001 (0x0001 - 0x0000)
struct LiveStreamAnimationSubsystem_SetRole final
{
public:
	ELiveStreamAnimationRole                      NewRole;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LiveStreamAnimation.LiveStreamAnimationSubsystem.StartTrackingLiveLinkSubject
// 0x0020 (0x0020 - 0x0000)
struct LiveStreamAnimationSubsystem_StartTrackingLiveLinkSubject final
{
public:
	class FName                                   LiveLinkSubject;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLiveStreamAnimationHandleWrapper      RegisteredName;                                    // 0x0008(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLiveStreamAnimationLiveLinkSourceOptions Options;                                        // 0x0010(0x0001)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FLiveStreamAnimationHandleWrapper      TranslationProfile;                                // 0x0014(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function LiveStreamAnimation.LiveStreamAnimationSubsystem.StopTrackingLiveLinkSubject
// 0x0008 (0x0008 - 0x0000)
struct LiveStreamAnimationSubsystem_StopTrackingLiveLinkSubject final
{
public:
	struct FLiveStreamAnimationHandleWrapper      RegisteredName;                                    // 0x0000(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LiveStreamAnimation.LiveStreamAnimationSubsystem.GetRole
// 0x0001 (0x0001 - 0x0000)
struct LiveStreamAnimationSubsystem_GetRole final
{
public:
	ELiveStreamAnimationRole                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LiveStreamAnimation.LiveLinkTestSkelMeshTrackerComponent.StartTrackingSkelMesh
// 0x0008 (0x0008 - 0x0000)
struct LiveLinkTestSkelMeshTrackerComponent_StartTrackingSkelMesh final
{
public:
	class FName                                   InSubjectName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

