#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: M_LRG_Professor_Pup_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_LRG_Professor_Pup_FaceAcc_AnimBP.M_LRG_Professor_Pup_FaceAcc_AnimBP_C
// 0x0B80 (0x0FD0 - 0x0450)
class UM_LRG_Professor_Pup_FaceAcc_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0458(0x0030)()
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x0490(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x08D0(0x0440)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0D10(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0D30(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0D50(0x00C0)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0E10(0x0140)(ContainsInstancedReference)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0F50(0x0078)()

public:
	void ExecuteUbergraph_M_LRG_Professor_Pup_FaceAcc_AnimBP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_LRG_Professor_Pup_FaceAcc_AnimBP_AnimGraphNode_LayeredBoneBlend_60AC983B43BA86BFC0695FB524784DCB();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_LRG_Professor_Pup_FaceAcc_AnimBP_C">();
	}
	static class UM_LRG_Professor_Pup_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_LRG_Professor_Pup_FaceAcc_AnimBP_C>();
	}
};

}

