#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: NitrogenUI

#include "Basic.hpp"

#include "NitrogenRuntime_structs.hpp"
#include "NitrogenUI_structs.hpp"


namespace SDK::Params
{

// Function NitrogenUI.NitrogenWidgetBase.HandleNitrogenGamePhaseChanged
// 0x0001 (0x0001 - 0x0000)
struct NitrogenWidgetBase_HandleNitrogenGamePhaseChanged final
{
public:
	ENitrogenGamePhase                            NewGamePhase;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenFareBonusWidget.OnActiveBonusUpdated
// 0x0138 (0x0138 - 0x0000)
struct NitrogenFareBonusWidget_OnActiveBonusUpdated final
{
public:
	struct FNitrogenBonusStat                     BonusStat;                                         // 0x0000(0x0130)(Parm, OutParm, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0130(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldAwardBonus;                                  // 0x0134(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function NitrogenUI.NitrogenFareBonusWidget.OnEndFare
// 0x0001 (0x0001 - 0x0000)
struct NitrogenFareBonusWidget_OnEndFare final
{
public:
	bool                                          bFareCompleted;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenFareMeterWidget.BonusProgressUpdate
// 0x0004 (0x0004 - 0x0000)
struct NitrogenFareMeterWidget_BonusProgressUpdate final
{
public:
	float                                         BonusProgressRatio;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenFareMeterWidget.FastDeliveryTimeUpdate
// 0x0004 (0x0004 - 0x0000)
struct NitrogenFareMeterWidget_FastDeliveryTimeUpdate final
{
public:
	float                                         RemainingTimeRatio;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenFareMeterWidget.OnActiveBonusUpdated
// 0x0138 (0x0138 - 0x0000)
struct NitrogenFareMeterWidget_OnActiveBonusUpdated final
{
public:
	struct FNitrogenBonusStat                     BonusStat;                                         // 0x0000(0x0130)(Parm, OutParm, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0130(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldAwardBonus;                                 // 0x0134(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function NitrogenUI.NitrogenFareMeterWidget.OnEndFare
// 0x0001 (0x0001 - 0x0000)
struct NitrogenFareMeterWidget_OnEndFare final
{
public:
	bool                                          bFareCompleted;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenFareMeterWidget.OnFareBonusFinshed
// 0x0001 (0x0001 - 0x0000)
struct NitrogenFareMeterWidget_OnFareBonusFinshed final
{
public:
	bool                                          BonusCompleted;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenFareMeterWidget.SetCurrentFareBaseRewardValue
// 0x0004 (0x0004 - 0x0000)
struct NitrogenFareMeterWidget_SetCurrentFareBaseRewardValue final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenFareMeterWidget.SetCurrentFareBonusObjectiveState
// 0x0002 (0x0002 - 0x0000)
struct NitrogenFareMeterWidget_SetCurrentFareBonusObjectiveState final
{
public:
	ENitrogenFareObjectiveDisplayState            DisplayState;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayAnimation;                                    // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenFareMeterWidget.SetCurrentFareTimedDeliveryObjectiveState
// 0x0002 (0x0002 - 0x0000)
struct NitrogenFareMeterWidget_SetCurrentFareTimedDeliveryObjectiveState final
{
public:
	ENitrogenFareObjectiveDisplayState            DisplayState;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayAnimation;                                    // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenLeaderboardWidget.UpdateLeaderboardUI
// 0x0018 (0x0018 - 0x0000)
struct NitrogenLeaderboardWidget_UpdateLeaderboardUI final
{
public:
	TArray<struct FNitrogenLeaderboardData>       LeaderboardInfo;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GoalScore;                                         // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function NitrogenUI.NitrogenObjectiveWidget.HandleVehicleEntered
// 0x0008 (0x0008 - 0x0000)
struct NitrogenObjectiveWidget_HandleVehicleEntered final
{
public:
	class AFortAthenaVehicle*                     NewVehicle;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenObjectiveWidget.OnEndFare
// 0x0001 (0x0001 - 0x0000)
struct NitrogenObjectiveWidget_OnEndFare final
{
public:
	bool                                          bFareCompleted;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenObjectiveWidget.SetShouldBeHidden
// 0x0001 (0x0001 - 0x0000)
struct NitrogenObjectiveWidget_SetShouldBeHidden final
{
public:
	bool                                          bInShouldBeHidden;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenObjectiveWidget.UpdateWidgetState
// 0x0001 (0x0001 - 0x0000)
struct NitrogenObjectiveWidget_UpdateWidgetState final
{
public:
	ENitrogenObjectiveWidgetState                 NewObjectiveWidgetState;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenPlacementWidget.HandleScoreChanged
// 0x0004 (0x0004 - 0x0000)
struct NitrogenPlacementWidget_HandleScoreChanged final
{
public:
	int32                                         Score;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenPlacementWidget.OnEndFare
// 0x0001 (0x0001 - 0x0000)
struct NitrogenPlacementWidget_OnEndFare final
{
public:
	bool                                          bFareCompleted;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenPlacementWidget.OnPlayerFareComplete
// 0x0004 (0x0004 - 0x0000)
struct NitrogenPlacementWidget_OnPlayerFareComplete final
{
public:
	int32                                         StarsGained;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenPlacementWidget.OnPlayerPlacementChanged
// 0x0008 (0x0008 - 0x0000)
struct NitrogenPlacementWidget_OnPlayerPlacementChanged final
{
public:
	int32                                         NewPlacement;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OldPlacement;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenPlacementWidget.OnPlayerScoreChanged
// 0x0004 (0x0004 - 0x0000)
struct NitrogenPlacementWidget_OnPlayerScoreChanged final
{
public:
	int32                                         NewScore;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenPlacementWidget.OnPlayerScoringUpdate
// 0x0020 (0x0020 - 0x0000)
struct NitrogenPlacementWidget_OnPlayerScoringUpdate final
{
public:
	int32                                         CurrentPlayerTeamScore;                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentPlayerTeamPlacement;                        // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GoalScore;                                         // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<uint8>                                 SortedTeamScores;                                  // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenScoreEventWidget.DisplayLeadChangedEvent
// 0x0001 (0x0001 - 0x0000)
struct NitrogenScoreEventWidget_DisplayLeadChangedEvent final
{
public:
	bool                                          bInLead;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitrogenUI.NitrogenScoreEventWidget.DisplayScoreEvent
// 0x0001 (0x0001 - 0x0000)
struct NitrogenScoreEventWidget_DisplayScoreEvent final
{
public:
	ENitrogenScoreReason                          ScoreReason;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

