#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: RootLayout_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RootLayout_Athena.RootLayout_Athena_C
// 0x0050 (0x03B8 - 0x0368)
class URootLayout_Athena_C final : public UFortRootViewportLayout_Athena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UConfirmationWindow_C*                  ConfirmationWindow;                                // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProgressModalWidget_C*                 ControllerDisconnectedModal;                       // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bClosingErrorDialog;                               // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   QuitTitle;                                         // 0x0388(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   QuitMessage;                                       // 0x03A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	bool IsConsole();
	void DialogResult_0099D78247C40A9775C753A2024EA419(EFortDialogResult Result, class FName ResultName);
	void Construct();
	void OnGameWindowCloseButtonClicked();
	void OnModalQueueEmptied_1();
	void ExecuteUbergraph_RootLayout_Athena(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RootLayout_Athena_C">();
	}
	static class URootLayout_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootLayout_Athena_C>();
	}
};

}

