#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ValetUI

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class ValetUI.FortAthenaVehicleFuelWidget
// 0x0070 (0x0308 - 0x0298)
class UFortAthenaVehicleFuelWidget final : public UFortHUDElementWidget
{
public:
	bool                                          bIsWidgetShowing;                                  // 0x0298(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AActor*                                 CurrentVehicleActor;                               // 0x02A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AddedFuelTimer;                                    // 0x02A8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentSpeed;                                      // 0x02AC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TargetFuelPercent;                                 // 0x02B0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DisplayedFuelPercent;                              // 0x02B4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FillBlendSpeed;                                    // 0x02B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AddedFuelShowDuration;                             // 0x02BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C0[0x4];                                      // 0x02C0(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         LowFuelThreshold;                                  // 0x02C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SpeedTextMaxInterpolationRate;                     // 0x02C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTagContainer                  WidgetTagsToHideWhenVisible;                       // 0x02D0(0x0020)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F0[0x8];                                      // 0x02F0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UCommonNumericTextBlock*                NumericText_Speed;                                 // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemName;                                     // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnAddedFuel(float NewFuelPercent);
	void OnBoostFinished();
	void OnBoostStarted();
	void OnLowInFuel();
	void OnOutOfFuel();
	void OnRechargableBoostFilled();
	void OnUpdateRechargeableBoostPercent(float BoostPercent);
	void OnValetNameUpdated();
	void SetupVehicleFuelWidget(class AActor* NewVehicle, const bool bRequestShowWidget);
	void SetVehicleProperties(bool bInfiniteFuel, bool bUsesRechargeableBoost);
	void ShowNoFuelMessage();
	void UpdateFuelWidgetVisibilities(bool bIsLowOnFuel);
	void UpdateRPMMeter(float NormalizedRPM);
	void UpdateSecondaryMeter(float FuelPercentage, bool bIsLowOnFuel);
	void UpdateSpeedometer(float NormalizedSpeed);

	class AFortDagwoodVehicle* GetDagwoodVehicle() const;
	class AActor* GetVehicle() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaVehicleFuelWidget">();
	}
	static class UFortAthenaVehicleFuelWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaVehicleFuelWidget>();
	}
};

// Class ValetUI.FortMobileActionButtonBehavior_ValetBoost
// 0x0008 (0x00B8 - 0x00B0)
class UFortMobileActionButtonBehavior_ValetBoost : public UFortMobileActionButtonBehavior
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileActionButtonBehavior_ValetBoost">();
	}
	static class UFortMobileActionButtonBehavior_ValetBoost* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileActionButtonBehavior_ValetBoost>();
	}
};

}

