#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: VinderTech_Umbrella_BuildABrella_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass VinderTech_Umbrella_BuildABrella_AnimBP.VinderTech_Umbrella_BuildABrella_AnimBP_C
// 0x0AD0 (0x0DF0 - 0x0320)
class UVinderTech_Umbrella_BuildABrella_AnimBP_C final : public UFortGliderAnimInstance
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0328(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0358(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x03A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x03C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x03F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0418(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0440(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0468(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0490(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x04B8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0530(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0560(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x05D8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0678(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x06F0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0720(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0798(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0838(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x08B0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x08E0(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0958(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x09F8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0A70(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0AA0(0x00B0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x0B50(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0C18(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0C90(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0D58(0x0078)()
	bool                                          IsParachuteOpen;                                   // 0x0DD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD1[0x3];                                      // 0x0DD1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         DeployAnimRate;                                    // 0x0DD4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0DD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TopSpin_Speed;                                     // 0x0DDC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SideSpinner_Speed;                                 // 0x0DE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP(int32 EntryPoint);
	void AnimNotify_TurnONEngines();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP_AnimGraphNode_TransitionResult_E824F722411E43EFD8D53388F983AC15();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP_AnimGraphNode_BlendListByBool_FC6AC43646BFF83548DD1181F767E020();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP_AnimGraphNode_TransitionResult_3F9BF7DA482FB171E62883A6287D540E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP_AnimGraphNode_BlendListByBool_593903404D65FDD6F938C494BF3C47E3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP_AnimGraphNode_BlendListByBool_F47B92874822AA40D486EBAB69007237();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP_AnimGraphNode_TransitionResult_43143CC64B4D11DA10FB6F80659222FE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP_AnimGraphNode_TransitionResult_3FCA25694E316D00699EA4926C611AFB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VinderTech_Umbrella_BuildABrella_AnimBP_AnimGraphNode_TransitionResult_48A86A26455B39A305B7268331329451();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VinderTech_Umbrella_BuildABrella_AnimBP_C">();
	}
	static class UVinderTech_Umbrella_BuildABrella_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVinderTech_Umbrella_BuildABrella_AnimBP_C>();
	}
};

}

